// **********************
// グローバル関数
// **********************

// カードの山 (配列)
// 自分のカード (配列)
// 相手のカード　(配列)
// 勝敗決定フラグ　(論理型)

// **********************
// イベントハンドラの割り当て
// **********************

// ページの読み込みが完了したとき実行する関数を登録
window.addEventListener("load", 初期表示);
// 「カードを引く」ボタンを押した時実行する関数を登録
document.querySelector("#ボタンのID").addEventListener("click", カードを引く);
// 「勝負する！」ボタンを押した時に実行する関数を登録
document.querySelector("#ボタンのID").addEventListener("click", 勝負する);
// 「もう一回遊ぶ」ボタンを押した時に実行する関数を登録
document.querySelector("#ボタンのID").addEventListener("click", もう一回遊ぶ);


// **********************
// イベントハンドラ
// **********************

// ページの読み込みが完了したときに実行する関数
function 初期表示() {
//     シャッフル
//     自分がカードを引く
//     相手がカードを引く
//     画面を更新する
};

// カードの山をシャッフルする関数
function シャッフル() {

};

// 「カードを引く」ボタンを押した時に実行する関数
// function カードを引く() {
//     自分がカードを引く
//     相手がカードを引く
//     画面を更新する
// };

// 「勝負する」ボタンを押した時実行する関数
// function 勝負する() {
//     勝敗を判定する
//     勝敗を画面に表示する
// };

// 「もう一回遊ぶ」ボタンを押した時実行する関数
// function もう一回遊ぶ() {
//     画面を初期表示に戻す
// };















**********************
グローバル関数
**********************
**********************
グローバル関数
**********************
